In [1]:
## packages 
import pandas as pd
import numpy as np

In [2]:
## inbuilt methods to read files: following file format can be read
#  - csv, excel, parquet, txt, json, etc.

In [3]:
# dir(pd)
df = pd.read_table('text.txt')
df.head()

    This is 1st line.
0   This is 2nd line.
1  This is 3rd line.
2   This is 4th line.
3   This is 5th line.
4  This is 6th line.

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
### nested list
df = pd.DataFrame(data = [[1,2,'3',4],[4,5],[2,4,6],[5,7,3,4]],
                  columns=['c1','c2','c3','c4'])
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     6  NaN
3   5   7     3  4.0

In [6]:
## Accessing dataframe elements
df['c2'] # returns series type

0    2
1    5
2    4
3    7
Name: c2, dtype: int64

In [7]:
df[['c2']] # returns dataframe type

   c2
0   2
1   5
2   4
3   7

In [8]:
## accessing multiple columns
df[['c2','c3','c4']]

   c2    c3   c4
0   2     3  4.0
1   5  None  NaN
2   4     6  NaN
3   7     3  4.0

In [9]:
##  slicing rows and columns
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     6  NaN
3   5   7     3  4.0

In [10]:
## .iloc
df.iloc[1:3,1:3] # will return  2nd and 3rd rows/columns

   c2    c3
1   5  None
2   4     6

In [11]:
df.iloc[1:3,:]

   c1  c2    c3  c4
1   4   5  None NaN
2   2   4     6 NaN

In [12]:
df.iloc[:,1:3]

   c2    c3
0   2     3
1   5  None
2   4     6
3   7     3

In [13]:
## .loc
df.loc[:,['c2','c3']]

   c2    c3
0   2     3
1   5  None
2   4     6
3   7     3

In [14]:
df.loc[2:4,['c2','c3']]

   c2 c3
2   4  6
3   7  3

In [15]:
## filter on dataframe
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     6  NaN
3   5   7     3  4.0

In [16]:
5 > 2

True

In [17]:
# select records from dataframe df where column 2 having > 2
condition = df['c2'] > 2
condition

0    False
1     True
2     True
3     True
Name: c2, dtype: bool

In [18]:
df[condition] # square bracket

   c1  c2    c3   c4
1   4   5  None  NaN
2   2   4     6  NaN
3   5   7     3  4.0

In [19]:
# select records from dataframe df where column 2 having > 2 
# and column1>2

condition = (df['c2'] > 2) & (df['c1'] > 2)
condition

0    False
1     True
2    False
3     True
dtype: bool

In [20]:
df[condition]

   c1  c2    c3   c4
1   4   5  None  NaN
3   5   7     3  4.0

In [21]:
df[(df['c2'] > 2) & (df['c1'] > 2)]

   c1  c2    c3   c4
1   4   5  None  NaN
3   5   7     3  4.0

In [22]:
# select column3 from dataframe df where column 2 having > 2 
# and column1>2
df1 = df[(df['c2'] > 2) & (df['c1'] > 2)]
df1['c3']

# or

df[(df['c2'] > 2) & (df['c1'] > 2)]['c3']

1    None
3       3
Name: c3, dtype: object

In [23]:
##
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     6  NaN
3   5   7     3  4.0

In [24]:
df.head(n = 1)

   c1  c2 c3   c4
0   1   2  3  4.0

In [25]:
df.tail(n = 1)

   c1  c2 c3   c4
3   5   7  3  4.0

In [26]:
## returns list of columns 
df.columns

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [27]:
df.shape #(rows, columns)

(4, 4)

In [28]:
df['c1'].values

array([1, 4, 2, 5])

In [29]:
# sort
df

   c1  c2    c3   c4
0   1   2     3  4.0
1   4   5  None  NaN
2   2   4     6  NaN
3   5   7     3  4.0

In [30]:
# sort dataframe on c2 in ascending order
df.sort_values(by = ['c2'],ascending=True)

   c1  c2    c3   c4
0   1   2     3  4.0
2   2   4     6  NaN
1   4   5  None  NaN
3   5   7     3  4.0

In [31]:
# example 2:
df.sort_values(by = ['c2'],ascending=[False])

   c1  c2    c3   c4
3   5   7     3  4.0
1   4   5  None  NaN
2   2   4     6  NaN
0   1   2     3  4.0

In [32]:
## 
df.sort_values(by = ['c2','c1'],ascending=[True,False])

   c1  c2    c3   c4
0   1   2     3  4.0
2   2   4     6  NaN
1   4   5  None  NaN
3   5   7     3  4.0

In [33]:
## Adding new columns
df['c5'] = 3
df

   c1  c2    c3   c4  c5
0   1   2     3  4.0   3
1   4   5  None  NaN   3
2   2   4     6  NaN   3
3   5   7     3  4.0   3

In [34]:
df['c6'] = np.linspace(10,14,4)
df

   c1  c2    c3   c4  c5         c6
0   1   2     3  4.0   3  10.000000
1   4   5  None  NaN   3  11.333333
2   2   4     6  NaN   3  12.666667
3   5   7     3  4.0   3  14.000000

In [35]:
## delete a column
df.drop(['c3'], axis = 1, inplace = True)

In [36]:
df

   c1  c2   c4  c5         c6
0   1   2  4.0   3  10.000000
1   4   5  NaN   3  11.333333
2   2   4  NaN   3  12.666667
3   5   7  4.0   3  14.000000

In [37]:
##
df.describe()

             c1        c2   c4   c5         c6
count  4.000000  4.000000  2.0  4.0   4.000000
mean   3.000000  4.500000  4.0  3.0  12.000000
std    1.825742  2.081666  0.0  0.0   1.721326
min    1.000000  2.000000  4.0  3.0  10.000000
25%    1.750000  3.500000  4.0  3.0  11.000000
50%    3.000000  4.500000  4.0  3.0  12.000000
75%    4.250000  5.500000  4.0  3.0  13.000000
max    5.000000  7.000000  4.0  3.0  14.000000

In [38]:
##
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
c1    4 non-null int64
c2    4 non-null int64
c4    2 non-null float64
c5    4 non-null int64
c6    4 non-null float64
dtypes: float64(2), int64(3)
memory usage: 288.0 bytes

In [39]:
## how to apply user-defined function on given dataframe
## .apply(), .applymap()
# .apply() -> works index wise or column wise
# .applymap() -> works element-wsie
df

   c1  c2   c4  c5         c6
0   1   2  4.0   3  10.000000
1   4   5  NaN   3  11.333333
2   2   4  NaN   3  12.666667
3   5   7  4.0   3  14.000000

In [40]:
df.apply('mean', axis = 0) # column-wise

c1     3.0
c2     4.5
c4     4.0
c5     3.0
c6    12.0
dtype: float64

In [41]:
df.apply('mean', axis = 1) # row-wise

0    4.000000
1    5.833333
2    5.416667
3    6.600000
dtype: float64

In [42]:
#
df.applymap(lambda x:x*2)

   c1  c2   c4  c5         c6
0   2   4  8.0   6  20.000000
1   8  10  NaN   6  22.666667
2   4   8  NaN   6  25.333333
3  10  14  8.0   6  28.000000

In [43]:
## looping through dataframe
for each in df.iteritems():
    print(each)

('c1', 0    1
1    4
2    2
3    5
Name: c1, dtype: int64)
('c2', 0    2
1    5
2    4
3    7
Name: c2, dtype: int64)
('c4', 0    4.0
1    NaN
2    NaN
3    4.0
Name: c4, dtype: float64)
('c5', 0    3
1    3
2    3
3    3
Name: c5, dtype: int64)
('c6', 0    10.000000
1    11.333333
2    12.666667
3    14.000000
Name: c6, dtype: float64)

In [44]:
for each in df.iterrows():
    print(each)

(0, c1     1.0
c2     2.0
c4     4.0
c5     3.0
c6    10.0
Name: 0, dtype: float64)
(1, c1     4.000000
c2     5.000000
c4          NaN
c5     3.000000
c6    11.333333
Name: 1, dtype: float64)
(2, c1     2.000000
c2     4.000000
c4          NaN
c5     3.000000
c6    12.666667
Name: 2, dtype: float64)
(3, c1     5.0
c2     7.0
c4     4.0
c5     3.0
c6    14.0
Name: 3, dtype: float64)

In [45]:
for each in df.itertuples():
    print(each)

Pandas(Index=0, c1=1, c2=2, c4=4.0, c5=3, c6=10.0)
Pandas(Index=1, c1=4, c2=5, c4=nan, c5=3, c6=11.333333333333334)
Pandas(Index=2, c1=2, c2=4, c4=nan, c5=3, c6=12.666666666666666)
Pandas(Index=3, c1=5, c2=7, c4=4.0, c5=3, c6=14.0)

In [46]:
##
df['c4'] = ['a','b','c','d']
df.to_csv('df_save.csv')

In [47]:
## group by on dataframe


# Name Age Salary 
# Rama 3   45
# Shyama 3 54
# Hary 2 67
# Peter 2 98

# 3 -> [45,54]-> m1
# 2 -> [67,98] -> m2

In [48]:
 
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 
                     'Kings', 'Kings', 'Kings', 'Kings', 'Riders',
                     'Royals', 'Royals', 'Riders'], 
            'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2], 
            'Year': [2014,2015,2014,2015,2014,2015,2016,
                     2017,2016,2014,2015,2017],
            'Points':[876,789,863,673,741,812,756,
                      788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
print(df.shape)
df.head()

(12, 4)

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [49]:
## FInd average of the points for each team
df.groupby(['Team']).groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 5, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64')}

In [50]:
df[df.Team == 'Devils']['Points'].mean()

768.0

In [51]:
## average
df.groupby(['Team'])['Points'].mean()

Team
Devils    768.00
Kings     774.25
Riders    762.25
Royals    752.50
Name: Points, dtype: float64

In [52]:
# max 
df.groupby(['Team'])['Points'].max()

Team
Devils    863
Kings     812
Riders    876
Royals    804
Name: Points, dtype: int64

In [53]:
## average
df.groupby(['Team'])['Points','Rank'].mean()

        Points  Rank
Team
Devils  768.00  2.50
Kings   774.25  2.25
Riders  762.25  1.75
Royals  752.50  2.50

In [54]:
## for each team : average-> points and maximum -> rank

df.groupby('Team')['Points','Rank'].agg({'Points':'mean',
                                        'Rank':max})

        Points  Rank
Team
Devils  768.00     3
Kings   774.25     4
Riders  762.25     2
Royals  752.50     4

In [55]:
## for each team : average-> points; maximum -> rank; max->year
df1 = df.groupby('Team')['Points','Rank','Year'].agg({'Points':'mean',
                                        'Rank':max,'Year':max})
df1

        Points  Rank  Year
Team
Devils  768.00     3  2015
Kings   774.25     4  2017
Riders  762.25     2  2017
Royals  752.50     4  2015

In [56]:
## for each team : average-> points; maximum -> rank; min->year
df1 = df.groupby('Team')['Points','Rank','Year'].agg({'Points':'mean',
                                        'Rank':max,'Year':min})
df1

        Points  Rank  Year
Team
Devils  768.00     3  2014
Kings   774.25     4  2014
Riders  762.25     2  2014
Royals  752.50     4  2014

In [57]:
# ## transformation()
# from each point subtract average of the points: 
#     average should be calculated on data belong to the same team 

df['diff_points'] = df.groupby('Team')['Points'].transform(lambda x: x - np.mean(x))
df.head()

     Team  Rank  Year  Points  diff_points
0  Riders     1  2014     876       113.75
1  Riders     2  2015     789        26.75
2  Devils     2  2014     863        95.00
3  Devils     3  2015     673       -95.00
4   Kings     3  2014     741       -33.25

In [58]:
## filter
df.groupby(['Team']).filter(lambda x: len(x)>2)

      Team  Rank  Year  Points  diff_points
0   Riders     1  2014     876       113.75
1   Riders     2  2015     789        26.75
4    Kings     3  2014     741       -33.25
5    Kings     4  2015     812        37.75
6    Kings     1  2016     756       -18.25
7    Kings     1  2017     788        13.75
8   Riders     2  2016     694       -68.25
11  Riders     2  2017     690       -72.25

### Dataframe Merge

#### briefing on join types : 2 types inner join, outer join(left, right, full)

        - inner join:      all common records are fetched/selected
        - left outer join: common + remaining elements from left table (left table is reference table)
        - right outer join: common + remaining elements from right table (right table is reference table)    
        - full outer join:  common + remaining elements from both left & right tables

In [59]:
pd.merge

<function pandas.core.reshape.merge.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)>

In [60]:
left = pd.DataFrame({ 'id':[1,2,3,4,5],
                     'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
                     'subject_id':['sub1','sub2','sub4','sub6','sub5']}) 

right = pd.DataFrame( {'id':[1,2,3,4,5],
                       'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
                       'subject_id':['sub2','sub4','sub3','sub6','sub5']})

        Print left and right
        Merge on id
        Merge on id & subject_id
        Perform left join on key = id 
        Perform right join on key = id
        Perform outer join on key = id
        Perform left join on keys = (id, subject_id)
        Perform right join on keys = (id, subject_id)
        Perform outer join on keys = (id, subject_id)

In [61]:
print(left)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

In [62]:
print(right)

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [63]:
pd.merge(left = left, right = right, how = 'inner', on = 'id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [64]:
#  Merge on id & subject_id
pd.merge(left = left, right = right, how = 'inner', on = ['id','subject_id'])

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

In [65]:
#  Perform left join on key = id 
pd.merge(left = left, right = right, how = 'left', on = 'id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [66]:
#  Perform right join on key = id 
pd.merge(left = left, right = right, how = 'right', on = 'id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [68]:
#  Perform outer join on key = id 
pd.merge(left = left, right = right, how = 'outer', on = 'id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [67]:
#   Perform left join on keys = (id, subject_id)
pd.merge(left = left, right = right, how = 'left', on = ['id','subject_id'])

   id  Name_x subject_id Name_y
0   1    Alex       sub1    NaN
1   2     Amy       sub2    NaN
2   3   Allen       sub4    NaN
3   4   Alice       sub6  Bryce
4   5  Ayoung       sub5  Betty

In [69]:
#   Perform right join on keys = (id, subject_id)
pd.merge(left = left, right = right, how = 'right', on = ['id','subject_id'])

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty
2   1     NaN       sub2  Billy
3   2     NaN       sub4  Brian
4   3     NaN       sub3   Bran

In [70]:
#   Perform outer join on keys = (id, subject_id)
pd.merge(left = left, right = right, how = 'outer', on = ['id','subject_id'])

   id  Name_x subject_id Name_y
0   1    Alex       sub1    NaN
1   2     Amy       sub2    NaN
2   3   Allen       sub4    NaN
3   4   Alice       sub6  Bryce
4   5  Ayoung       sub5  Betty
5   1     NaN       sub2  Billy
6   2     NaN       sub4  Brian
7   3     NaN       sub3   Bran